app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
       if Artist.exists?(params[:artist_id])
        artist = Artist.find(params[:artist_id])
        @songs = artist.songs
       else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
       end
      else
        @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
       if Artist.exists?(params[:artist_id])
        @artist = Artist.find(params[:artist_id])
          if Artist.find(params[:artist_id]).songs.exists?(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]